#ifndef __IPOINTCLOUDSTORAGE_H__
#define __IPOINTCLOUDSTORAGE_H__

/*///////////////////////////////////////////////////////////////////////////////////////
//                               IPointCloudStorage                                    //
//-------------------------------------------------------------------------------------//
// Этот класс является абстрактным и представляет собой интерфейс для сохранения       //
// облаков точек. Другие классы будут наследовать данный класс и создавать собственную //
// реализацию по сохранению облака точек в определенный формат файла.                  //
//                                                                                     //
// Этот интерфейс предоставляет следующие функции:                                     //
//  - создание файла                                                                   //
//  - запись точки с заданными координатами в этот файл                                //
/*///////////////////////////////////////////////////////////////////////////////////////

class IPointCloudStorage
{

};

#endif