#ifndef __POINTCLOUDSTORAGE_H__
#define __POINTCLOUDSTORAGE_H__

/*///////////////////////////////////////////////////////////////////////////////////////
//                               PointCloudStorage                                     //
//-------------------------------------------------------------------------------------//
// Этот класс служит для хранения облака точек.                                        //
// Он сохраняет трехмерные информации о точках, а так же информацию о цвете точки      //
// из исходных изображений.                                                            //
//                                                                                     //
// Данный класс имеет методы для сохранения облака точек в файлы, которые распознаются //
// внешними программа отображения 3d моделей.                                          //
// Список поддерживаемых форматов:                                                     //
//	1. obj                                                                             //
/*///////////////////////////////////////////////////////////////////////////////////////

class PointCloudStorage
{

};

#endif