#ifndef __STEREOCALIBDATA_H__
#define __STEREOCALIBDATA_H__

/*///////////////////////////////////////////////////////////////////////////////////////
//                                StereoCalibData                                      //
//-------------------------------------------------------------------------------------//
// Этот класс инкапсулирует параметры, необходимые для построение облака точек по      //
// двум изображениям:                                                                  //
//  - Матрицы двух камер                                                               //
//  - Коэффициенты дисторсии двух камер                                                //
//  - Матрицы преобразований для выравнивания изображений                              //
//  - Матрицу Q - матрицу перевода карты смещений в облако точек                       //
//  - А так же другие матрицы, получаемые в результате операций калибровки             //
// Так же этот класс имеет методы по загрузке и сохранению данных коэффициентов        //
// в хранилище                                                                         //
/*///////////////////////////////////////////////////////////////////////////////////////

class StereoCalibData
{

};

#endif